<template>
    <v-card
    class="px-5">
    <v-card-title>
        История и архитектура PostgreSQL. Установка и базовые принципы администрирования PostgreSQL на Windows и Linux
    </v-card-title>
    <p>
        PostgreSQL — наиболее полнофункциональная, свободно распространяемая СУБД с открытым кодом. Разработанная в академической среде, за долгую историю сплотившая вокруг себя широкое сообщество разработчиков, эта СУБД обладает всеми возможностями, необходимыми большинству заказчиков. PostgreSQL активно применяется по всему миру для создания критичных бизнес-систем, работающих под большой нагрузкой. 
    </p>
    <p>
        <span class="bold-header">
            Немного истории 

        </span>

        Современный PostgreSQL ведет происхождение от проекта POSTGRES, который разрабатывался под руководством Майкла Стоунбрейкера (Michael Stonebraker), профессора Калифорнийского университета в Беркли. До этого Майкл Стоунбрейкер уже возглавлял разработку INGRES — одной из первых реляционных СУБД, — и POSTGRES возник как результат осмысления предыдущей работы и желания преодолеть ограниченность жесткой системы типов. Работа над проектом началась в 1985 году, и до 1988 года был опубликован ряд научных статей, описывающих модель данных, язык запросов POSTQUEL (в то время SQL еще не был общепризнанным стандартом) и устройство хранилища данных. 4 i POSTGRES иногда относят к так называемым постреляционным СУБД. Ограниченность реляционной модели всегда была предметом критики, хотя и являлась обратной стороной ее простоты и строгости. Однако проникновение компьютерных технологий во все сферы жизни привело к появлению новых классов приложений и потребовало от баз данных поддержки нестандартных типов данных и таких возможностей, как наследование, создание сложных объектов и управление ими.
    </p>
    <p>
        <span class="bold-header">
            Современное состояние. 
        </span>
        PostgreSQL является одной из самых популярных баз данных. За свою более чем 20-летнюю историю развития на прочном фундаменте, заложенном академической разработкой, PostgreSQL выросла в полноценную СУБД уровня предприятия и составляет реальную альтернативу коммерческим базам данных. Чтобы убедиться в этом, достаточно посмотреть на важнейшие характеристики новейшей на сегодняшний день версии PostgreSQL 13. 
    </p>
    <p>
        <span class="bold-header">

            Надежность и устойчивость.
        </span>
        Вопросы обеспечения надежности особенно важны в приложениях уровня предприятия для работы с критически важными данными. С этой целью PostgreSQL позволяет настраивать горячее резервирование, восстановление на заданный момент времени в прошлом, различные виды репликации (синхронную, асинхронную, каскадную).
    </p>
    <p>
        <span class="bold-header">
            Безопасность.
            
        </span>
        PostgreSQL позволяет подключаться по защищенному SSLсоединению и предоставляет аутентификацию по паролю (включая SCRAM), возможность использования клиентских сертификатов, аутентификацию с помощью внешних сервисов (LDAP, RADIUS, PAM, Kerberos). При управлении пользователями и доступом к объектам БД предоставляются следующие возможности: 
        <ul>
            <li>

                создание и управление пользователями и групповыми ролями; 
            </li>
            <li>
                разграничение доступа к объектам БД на уровне как отдельных пользователей, так и групп; 

            </li>
            <li>
                детальное управление доступом на уровне отдельных столбцов и строк; 

            </li>
            <li>

                поддержка SELinux через встроенную функциональность SE-PostgreSQL (мандатное управление доступом).
            </li>
        </ul>
    </p>
    <p>
        <span class="bold-header">
            
            Поддержка транзакционности
        </span>

        PostgreSQL обеспечивает полную поддержку свойств ACID и обеспечивает эффективную изоляцию транзакций. Для этого в PostgreSQL используется механизм многоверсионного управления одновременным доступом (MVCC), который позволяет обходиться без блокировок строк во всех случаях, кроме одновременного изменения одной и той же строки данных в нескольких процессах: читающие транзакции никогда не блокируют пишущих транзакций, а пишущие — читающих. Это справедливо и для самого строгого уровня изоляции serializable, который, используя инновационную систему Serializable Snapshot Isolation, обеспечивает полное отсутствие аномалий сериализации и гарантирует, что при одновременном выполнении транзакций результат будет таким же, как и при последовательном выполнении.
    </p>
    <p>
        <span class="bold-header">
            
            Для разработчиков приложений
        </span>

        Разработчики приложений получают в свое распоряжение богатый инструментарий, позволяющий реализовать приложения любого типа: 
        <ul>
            <li>

                всевозможные языки серверного программирования: встроенный PL/pgSQL (удобный своей тесной интеграцией с SQL), C для критичных по производительности задач, Perl, Python, Tcl, а также JavaScript, Java и другие; 
            </li>
            <li>
                программные интерфейсы для обращения к СУБД из приложений на любом языке, включая стандартные интерфейсы ODBC и JDBC; • набор объектов баз данных, позволяющий эффективно реализовать логику любой сложности на стороне сервера: таблицы и индексы, последовательности, ограничения целостности, представления и материализованные представления, секционирование, подзапросы и with запросы (в том числе рекурсивные), агрегатные и оконные функции, хранимые функции, триггеры и т. д.; 

            </li>
            <li>

                гибкая система полнотекстового поиска с поддержкой русского и всех европейских языков, дополненная эффективным индексным доступом; 
            </li>
            <li>
                слабоструктурированные данные в духе NoSQL: хранилище пар «ключ-значение» hstore, xml, json (в текстовом и в эффективном двоичном представлении jsonb); 

            </li>
            <li>

                подключение источников данных, включая все основные СУБД, в качестве внешних таблиц по стандарту SQL/MED с возможностью их полноценного использования, в том числе для записи и распределенного выполнения запросов (Foreign Data Wrappers).
            </li>
        </ul>
    </p>
    <p>
        <span class="bold-header">
            
            Планировщик запросов
        </span>

        В PostgreSQL используется планировщик запросов, основанный на стоимости. Используя собираемую статистику и учитывая в своих математических моделях как дисковые операции, так и время работы процессора, планировщик позволяет оптимизировать самые сложные запросы. В его распоряжении находятся все методы доступа к данным и способы выполнения соединений, характерные для передовых коммерческих СУБД.
    </p>
    <p>
        <span class="bold-header">
            
            Возможности индексирования 
        </span>

        В PostgreSQL реализованы различные способы индексирования. Помимо традиционных B-деревьев доступно множество других методов доступа. 
        <ul>
            <li>

                Hash — индекс на основе хеширования. В отличие от Bдеревьев, такие индексы работают только при проверке на равенство, но в ряде случаев могут оказаться компактнее и эффективнее. 
            </li>
            <li>

                GiST — обобщенное сбалансированное дерево поиска, которое применяется для данных, не допускающих упорядочения. Примерами могут служить R-деревья для индексирования точек на плоскости с возможностью быстрого поиска ближайших соседей (k-NN search) и индексирование операции пересечения интервалов. 
            </li>
            <li>

                SP-GiST — обобщенное несбалансированное дерево, основанное на разбиении области значений на непересекающиеся вложенные области. Примерами могут служить дерево квадрантов для пространственных данных и префиксное дерево для текстовых строк. 
            </li>
            <li>
                GIN — обобщенный инвертированный индекс, который используется для сложных значений, состоящих из элементов. Основной областью применения является полнотекстовый поиск, где требуется находить документы, в которых встречается указанные в поисковом запросе слова. Другим примером использования является поиск значений в массивах данных.

            </li>
            <li>
                RUM — дальнейшее развитие метода GIN для полнотекстового поиска. Этот индекс, доступный в виде расширения, позволяет ускорить фразовый поиск и сразу выдавать результаты упорядоченными по релевантности.

            </li>
            <li>

                BRIN — компактная структура, позволяющая найти компромисс между размером индекса и скоростью поиска. Такой индекс эффективен на больших кластеризованных таблицах. 
            </li>
            <li>
                
                Bloom — индекс, основанный на фильтре Блума. Такой индекс, имея очень компактное представление, позволяет быстро отсечь заведомо ненужные строки, однако требует перепроверки оставшихся. Многие типы индексов могут создаваться не только по одному, но и по нескольким столбцам таблицы. Независимо от типа можно строить индексы как по столбцам, так и по произвольным выражениям, а также создавать частичные индексы только для определенных строк. Покрывающие индексы позволяют ускорить запросы за счет того, что все необходимые данные извлекаются из самого индекса без обращения к таблице. В арсенале планировщика имеется сканирование по битовой карте, которое позволяет объединять сразу несколько индексов для ускорения доступа.
            </li>
        </ul>
    </p>
    <p>
        <span class="bold-header">
            
            Кроссплатформенность 
        </span>
        PostgreSQL работает на операционных системах семейства Unix, включая серверные и клиентские разновидности Linux, FreeBSD, Solaris и macOS, а также на Windows.  За счет открытого и переносимого кода на языке C PostgreSQL можно собрать на самых разных платформах, даже если для них отсутствует поддерживаемая сообществом сборка.
    </p>
    <p>
        <span class="bold-header">
            
            Установка  на Windows 
        </span>
        Скачайте установщик <a href="https://postgrespro.ru/products/download" target="_blank">https://postgrespro.ru/products/download</a>  , запустите его и выберите язык установки: <a href="https://postgrespro.ru/windows" target="_blank">https://postgrespro.ru/windows</a>  . Установщик построен в традиционном стиле «мастера»: вы можете просто нажимать на кнопку «Далее», если вас устраивают предложенные варианты. Остановимся подробнее на основных шагах. 
        Компоненты устанавливаемой программы:
        <v-img src="@/assets/4.png"></v-img>
        Оставьте все флажки, если не уверены, какие выбрать. 
        Далее следует выбрать каталог для установки PostgreSQL. По умолчанию установка выполняется в папку C:\Program Files\PostgreSQL\13. Отдельно можно выбрать расположение каталога для баз данных.
        <v-img src="@/assets/5.png"></v-img>
        Именно здесь будет находиться хранимая в СУБД информация, так что убедитесь, что на диске достаточно места, если вы планируете хранить много данных.
        Параметры сервера:
        <v-img src="@/assets/6.png"></v-img>Если вы планируете хранить данные на русском языке, выберите локаль «Russian, Russia» (или оставьте вариант «Настройка ОС», если в Windows используется русская локаль). 
Введите (и подтвердите повторным вводом) пароль пользователя СУБД postgres. Также отметьте флажок «Настроить переменные среды», чтобы подключаться к серверу PostgreSQL под текущим пользователем ОС. 
Остальные поля можно оставить со значениями по умолчанию.
<v-img src="@/assets/7.png"></v-img>

Если вы планируете установить PostgreSQL только для ознакомительных целей, можно отметить вариант «Использовать параметры по умолчанию», чтобы СУБД не занимала много оперативной памяти.
    </p>
    <p>
        <span class="bold-header">
            Управление службой и основные файлы 
            
        </span>
        При установке PostgreSQL в вашей системе регистрируется служба «postgresql-13». Она запускается автоматически при старте компьютера под учетной записью Network Service (Сетевая служба). При необходимости вы можете изменить параметры службы с помощью стандартных средств Windows.
        <v-img src="@/assets/8.png"></v-img>
        Чтобы временно остановить службу сервера баз данных, выполните программу «Stop Server» из папки в меню «Пуск», которую вы указали при установке. 
Для запуска службы там же находится программа «Start Server». 
Если при запуске службы произошла ошибка, для поиска причины следует заглянуть в журнал сообщений сервера. Он находится в подкаталоге log каталога, выбранного при установке для баз данных (обычно C:\Program Files\PostgreSQL\13\data\log). Журнал настроен так, чтобы запись периодически переключалась в новый файл. Найти актуальный файл можно по дате последнего изменения или по имени, которое содержит дату и время переключения. 

Есть несколько важных конфигурационных файлов, которые определяют настройки сервера. Они располагаются в каталоге баз данных. Вам не нужно их изменять, чтобы начать знакомство с PostgreSQL, но в реальной работе они непременно потребуются:
        <ul>
            <li>
                postgresql.conf — это основной конфигурационный файл, содержащий значения параметров сервера;

            </li>
            <li>

                pg_hba.conf — файл, определяющий настройки доступа. В целях безопасности по умолчанию доступ должен быть подтвержден паролем и допускается только с локального компьютера.
            </li>
        </ul>
        Обязательно загляните в эти файлы — они прекрасно документированы. Теперь мы готовы подключиться к базе данных и попробовать некоторые команды и запросы.
</p>
<p>
    <span class="bold-header">
        Debian и Ubuntu Установка
            
        </span>

        Если вы используете Linux, то для установки необходимо подключить пакетный репозиторий PGDG (PostgreSQL Global Development Group). В настоящее время для системы Debian поддерживаются версии 8 «Jessie», 9 «Stretch», 10 «Buster» и 11 «Bullseye», а для Ubuntu — 16.04 «Xenial», 18.04 «Bionic» и 20.04 «Focal». 
        Выполните в терминале следующие команды:
        <div class="code-example">
    $ sudo apt-get install lsb-release $ sudo sh -c 'echo "deb \ http://apt.postgresql.org/pub/repos/apt/ \ $(lsb_release -cs)-pgdg main" \ > /etc/apt/sources.list.d/pgdg.list' 
    $ wget --quiet -O - \ https://www.postgresql.org/media/keys/ACCC4CF8.asc \ | sudo apt-key add -
            
        </div>
</p>
<p>
    Репозиторий подключен, обновим список пакетов:
    <div class="code-example">
        $ sudo apt-get update	

    </div>
    
    Перед установкой проверьте настройки локализации:
    <div class="code-example">

        $ locale
    </div>
    Если вы планируете хранить данные на русском языке, значение переменных LC_CTYPE и LC_COLLATE должно быть равно «ru_RU.UTF8» (значение «en_US.UTF8» тоже подходит, но менее предпочтительно). При необходимости установите эти переменные:
    <div class="code-example">
        
        $ export LC_CTYPE=ru_RU.UTF8 
        <hr>
        $ export LC_COLLATE=ru_RU.UTF8

    </div>
</p>
<p>
    Также убедитесь, что в операционной системе установлена соответствующая локаль:
    <div class="code-example">
        
        $ locale -a | grep ru_RU
        ru_RU.utf8

    </div>
    Если это не так, сгенерируйте ее:
    <div class="code-example">

        $ sudo locale-gen ru_RU.utf8
    </div>
    Теперь можно приступить к установке:
    <div class="code-example">
        $ sudo apt-get install postgresql-13
        
    </div>
    
    Как только эта команда выполнится, СУБД PostgreSQL будет установлена, запущена и готова к работе. Чтобы проверить это, выполните команду:
    <div class="code-example">
        
        $ sudo -u postgres psql -c 'select now()'
    </div>

    Если все проделано успешно, в ответ вы должны получить текущее время.
</p>
<p>
    <span class="bold-header">

        Контрольные вопросы
    </span>
    <ol>
        <li>
            От какого проекта ведёт происхождение современный PostgreSQL?

        </li>
        <li>

            На каких уровнях происходит разграничение доступа к объектам БД?
        </li>
        <li>

            Какую информацию хранят в себе postgresql.conf и pg_hba.conf?
        </li>
        <li>
            Какие языки поддерживает PostgreSQL?

        </li>
        <li>

            Какой командной можно получить текущее время? 
        </li>
    </ol>
</p>
 <p>
    <span class="bold-header">
        
        Упражнения для самостоятельной работы
    </span>
    <ol>
        <li>

            Попробуйте запустить и остановить службу сервера баз данных.
            Ответ: чтобы временно остановить службу сервера баз данных, выполните команду:
            <div class="code-example">
                $ sudo systemctl stop postgresql
        
            </div>
            Запустить службу сервера можно командой:
            <div class="code-example">
        
                $ sudo systemctl start postgresql
            </div>
            Можно также проверить текущее состояние:
            <div class="code-example">
        
                $ sudo systemctl status postgresql
    </div>
        </li>
        <li>

            Ознакомьтесь с конфигурационными файлами PostgreSQL
        </li>
        <li>

            Ознакомьтесь с графическим клиентом pgAdmin.
        </li>
    </ol>
 </p>


    </v-card>
</template>

<script>
import Navigation from '@/components/Navigation.vue'

export default {
    name: 'Section1',
    components: {
        Navigation
    }
}
</script>