<template>
    <v-card
    class="px-5">
        <v-card-title>
            Комплекс практических заданий для проверки умений и навыков
        </v-card-title>
        <p>
            <span class="bold-header">

                Задание №1. Создать web-приложение совместимости слов. Пользователь вводит 2 слова в 2 разных текстовых поля, затем нажимает на кнопку и получает число – процент совместимости слов. Для этого два слова должны быть переданы на серверную часть приложения, где и будет вычисляться числовая характеристика. Совместимость определять как отношение суммы одинаковых букв в словах к длине наибольшего слова. Вычисленную характеристику отразить на странице.
            </span>
            <br>
            <span class="bold-header">
                
                Критерии оценивания: 
            </span>
            <ul>
                <li>Вычисление совместимости происходит на стороне сервера и возвращается на страницу – 3б.</li>
                <li>Вычисление происходит прямо на странице – 1 б.</li>
            </ul>
            Макс. балл – 3.
        </p>
        <p>
            <span class="bold-header">
Задание №2. На основе приложения из задания 1 сделать доработку: сохранять сравниваемые пары слов и их результаты, и отображать пользователю последние 5 глобальных запросов (например, сделать сохранение через файловую систему).
            </span>
            <br>
            <span class="bold-header">
                
                Критерии оценивания: 
            </span>
            <ul>
                •	
                <li>Пользователь видит только свои запросы – 1 б.</li>
                <li>Пользователь видит глобальные запросы – 4 б.</li>
            </ul>
            Макс. балл – 4.
        </p>
        <p>
            <span class="bold-header">

                Задание №3. Реализовать приложение-склад. Пользователь может вводить данные в 2 поля ввода: 1 – название товара, 2 – стоимость. Система принимает товары и сохраняет их, возвращая пользователю номер чека. Пользователь может ввести номер чека и получить название товара и его стоимость.
            </span>
            <br>
            <span class="bold-header">
                
                Критерии оценивания: 
            </span>
            <ul>
                <li>
                    
                    Система отслеживает правильность ввода цены: целое число – 1 б.
                </li>
                <li>
                    Система реализует хранение товаров, но не может возвращать информацию по номеру чека – 2 б.
                    
                </li>
                <li>

                    Система реализует хранение товаров и возвращает информацию по номеру чека – 3б.
                </li>
            </ul>
            Макс. балл – 4.
        </p>

    </v-card>
</template>

<script>
export default {
    name: 'Tasks'
}
</script>