<template>
    <v-card
    class="px-5">
        <v-card-title>
            Комплекс практических заданий для проверки умений и навыков
        </v-card-title>
        
        <p>
            <span class="bold-header">
                Задание №1.
            </span> Для разработанной в ходе курса базы данных создать триггеры, триггерные функции.
            <p>
                Основные требования:
            </p>
            <ol>
                <li>
                    Любой SQL-код должен сопровождаться комментариями;
                </li>
                <li>
                    При изменении цены на ингредиент должна меняться цена у продуктов, а также заказов, в которых содержится продукт с изменёнными ценами ингредиентов. Охарактеризовать выбранный способ решения;
                </li>
            </ol>
        </p>

        <p>
            <span class="bold-header">
                Задание №2.
            </span> Для разработанной в ходе курса базы данных создать необходимые профили доступа, а также статистику.
            <p>
                Необходимые Профили доступа:
            </p>
            <ul>
                <li>
                    Главный менеджер;
                </li>
                <li>
                    Комплектовщик заказа.
                </li>
            </ul>
            <p>
                Необходимая статистика:
            </p>
            <ul>
                <li>
                    Для каждого месяца определить продукт, который добавлялся в заказ наибольшее количество раз.

                </li>
                <li>
                    Для каждого месяца вывести отменённые заказы, а также комплектацию их продуктов с промежуточными суммами стоимости заказа.

                </li>
                <li>

                    Определить топ 5 ингредиентов, встречающихся в заказах за последний месяц.
                </li>
            </ul>
            <p>
                <span class="bold-header">
                    Основные требования:
                </span>
            </p>
            <ul>
                <li>

                    Любой SQL-код должен сопровождаться комментариями;
                </li>
                <li>

                    Главный менеджер имеет права на просмотр, изменение, добавление и удаление записей в любых таблицах;
                </li>
                <li>

                    Комплектовщик заказа имеет права на просмотр, изменение, добавление и удаление заказа;
                </li>
                <li>

                    Охарактеризовать выбор встроенного инструмента для создания необходимой статистики;
                </li>
            </ul>
        </p>
        <p>
            <span class="bold-header">
                Задание №3. 
            </span> Разработать графическое приложение для работы с построенной базой данных компании-производителя мороженного.
            <p>
                <span class="bold-header">
                    Основные требования:
                </span>
                <ol>
                    <li>
                        	Допускается использовать любой язык программирования, в котором существуют библиотеки для работы с СУБД PostgreSQL.
Пример: Python и библиотека Psycopg2;
                    </li>
                    <li>
                        	Охарактеризовать выбор библиотеки для работы с СУБД PostgreSQL;
                    </li>
                    <li>
                        	Допускается использовать любой фреймворк для создания графического приложения.
Пример: PyQt;
                    </li>
                    <li>
                        	Просмотр таблиц-справочников должен происходить через выпадающее меню приложения;
                    </li>
                    <li>
                        	В приложении есть две главные роли, выдающиеся аккаунтам-пользователям, - главный менеджер и комплектовщик заказа. Профиль распознаётся при входе в приложение через логин и пароль;
                    </li>
                    <li>
                        	 Для просмотра всех справочников требуется профиль главного менеджера, если прав недостаточно – выводить соответствующее сообщение. Комплектовщик может смотреть (изменять не может) все справочники, за исключением ингредиентов. Отразить это графически;

                    </li>
                    <li>
                        	Для каждого справочника должна быть предусмотрена графическая возможность манипуляции данных. Вызов диалоговых окон с формами, содержащими необходимые поля. Сами функции по манипуляции с данными уже должны быть реализованы на уровне базы данных;

                    </li>
                    <li>
                        	Для показа подробной информации о заказе предусмотреть интерфейсное взаимодействие. Пример: двойной щелчок по записи;
                    </li>
                    <li>
                        	Раздел статистики оформляется в произвольной форме.
                            Пример работы с библиотекой Psycopg2:
                            <pre>
    import psycopg2 as ps2

    def selectFromBD(cursor, query):

        cursor.execute(query)
        result = cursor.fetchall()
        return result

    def transaction(conn, query):

        cursor = conn.cursor()
        result = cursor.execute(query)
        conn.commit()
        cursor.close()

    def connect(userName, userPassw):
        return ps2.connect(dbname='IceCreamCompany', user=userName,
                        password=userPassw, host='localhost')
                            </pre>


                    </li>
                </ol>
            </p>
        </p>
        <p>
            <span class="bold-header">
                Категории оценки:
            </span>
            <ol>
                <li>
                    
                    Полнота выполнения пунктов ТЗ;
                </li>
                <li>
                    Корректность работы объектов базы данных при разнообразных манипуляциях с данными;

                </li>
                <li>
                    Осмысленность использования инструментов для создания тех или иных объектов базы данных;

                </li>
                <li>

                    Корректность работы объектов базы данных при разнообразных манипуляциях с данными через графическое приложение;
                </li>
                <li>

                    Обработка разнообразных исключений при работе с графическим приложением;
                </li>
            </ol>
        </p>
    </v-card>
</template>

<script>
export default {
    name: 'Tasks'
}
</script>